notes/algo_ds/algo_review.org
#+title: Algorithm and Data Struct 

* Data Structure
** List

*** Representation Format
    - Array: It is a contiguous data structure. The items store in adjancent memory address in memory.
    - Link list: The list is represented using pointers.
      - Double link list

*** Commonly used Operations
    - Get: elemtype get(list l, int pos)
    - Insert:  bool insert(list l, elemtype x, int pos)
    - Delete:  bool delete(list l , elemtype x)
    - Search: int search(list l, elemtype x)
**** Operation implementation for Array representation
***** Get
#+begin_src c
elemtype get( list l , int pos) {
  return l.list[pos];
}
#+end_src

***** Insert
#+begin_src c
bool insert(list l, elemtype x, int pos)
{
  int len= l.length;
  if(len+1 >= MAXSIZE) {
    ori_l = l.list;
    l.list = (elemtype*) malloc( sizeof(elemtype) * MAXSIZE *2);

    if(l.list == NULL)
      return false;

    memcpy( l.list, ori_l, sizeof(elemtype)*l.length);
    free(ori_l);
  }
  
  for( i = l.length-1; i > pos; i++) {
    l.list[l] = l.list[l-1];
  }
  l.list[pos] = x;
  l.length++;

  return true;
}
#+end_src

***** Search
#+begin_src c
int search(list l, elemtype x) {
  int res_pos;
  int len = l.length;
  for(int i=0; i < len; i++) {
    if(l.list[i] == x)
      return i;
  }
  if( i == len)
    return -1;
}
#+end_src

***** Delete
#+begin_src c
bool delete(list l, elemtype x) {
  int pos = search(l, x);
  if(pos == -1 ) {
    cout << "Can not find the element";
    return false;
  }
  for(int i = pos; i < l.length-1; i++) {
    l.list[i] == l.list[i+1];
  }
  l.length--;
  return true;
}
#+end_src


**** Operation implementation for Link list representation

***** Get

#+begin_src c
elemtype get(list l, int pos) {
  int i = 0;
  node* p = l.list;
  while( i < pos) {
    p = p->next;
    i++;
  }
  return p->val;
}
#+end_src

***** Search

#+begin_src c
int search( list l, elemtype x) {
  int res=0;
  
  p = l.list;
  while(p!=NULL) {
    if(p->val == x)
      return res;
    else {
      p = p->next;
      res++;
    }
  }
  if(p == NULL)
    return -1;
}
#+end_src

