notes/algo_ds/algo_review.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Algorithm and Data Struct</title>
<!-- 2013-07-03 Wed 22:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="erlv"/>
</head>
<body>
<div id="content">
<h1 class="title">Algorithm and Data Struct</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Data Structure</a>
<ul>
<li><a href="#sec-1-1">1.1. List</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. Representation Format</a></li>
<li><a href="#sec-1-1-2">1.1.2. Commonly used Operations</a></li>
<li><a href="#sec-1-1-3">1.1.3. Other data structures based on List</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. Tree</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. Tree Operations</a></li>
<li><a href="#sec-1-2-2">1.2.2. Binary Search Tree</a></li>
<li><a href="#sec-1-2-3">1.2.3. Trie Tree</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. Graph</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. Graph properties</a></li>
<li><a href="#sec-1-3-2">1.3.2. Graph Operations</a></li>
<li><a href="#sec-1-3-3">1.3.3. Data Representations</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. Other Specialized Data Structures</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1. String Data Structure</a></li>
<li><a href="#sec-1-4-2">1.4.2. Geometric Data Structure</a></li>
<li><a href="#sec-1-4-3">1.4.3. Graph Data Structure</a></li>
<li><a href="#sec-1-4-4">1.4.4. Set Data Structure</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. Algorithm</a>
<ul>
<li><a href="#sec-2-1">2.1. Traveling Salesman Problem</a></li>
<li><a href="#sec-2-2">2.2. Independent Set Problem</a></li>
<li><a href="#sec-2-3">2.3. String Pattern Matching</a></li>
<li><a href="#sec-2-4">2.4. Matrix Multiplication</a></li>
<li><a href="#sec-2-5">2.5. Sorting</a>
<ul>
<li><a href="#sec-2-5-1">2.5.1. Heap Sort</a></li>
<li><a href="#sec-2-5-2">2.5.2. Merge Sort</a></li>
<li><a href="#sec-2-5-3">2.5.3. Quick Sort</a></li>
<li><a href="#sec-2-5-4">2.5.4. External Sort</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. My Weak Algorithm</a>
<ul>
<li><a href="#sec-3-1">3.1. Dynamic Programming</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1. Fibonacci</a></li>
<li><a href="#sec-3-1-2">3.1.2. Binomial Coefficients</a></li>
<li><a href="#sec-3-1-3">3.1.3. Approximate String Matching</a></li>
<li><a href="#sec-3-1-4">3.1.4. TOPCODER SRM 551-1-1000 SweetFruits</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-4">4. Programming</a>
<ul>
<li><a href="#sec-4-1">4.1. 2-1 Primary Arithmetic</a></li>
<li><a href="#sec-4-2">4.2. 7-1 Little Bishops</a>
<ul>
<li><a href="#sec-4-2-1">4.2.1. My Solution</a></li>
<li><a href="#sec-4-2-2">4.2.2. Suggested Solution</a></li>
</ul>
</li>
<li><a href="#sec-4-3">4.3. 15-Puzzle Problem</a></li>
<li><a href="#sec-4-4">4.4. Tug of War</a></li>
<li><a href="#sec-4-5">4.5. Color Hash</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Data Structure</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> List</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Representation Format</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>Array: It is a contiguous data structure. The items store in adjancent memory address in memory.
</li>
<li>Link list: The list is represented using pointers.
<ul class="org-ul">
<li>Double link list
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Commonly used Operations</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>Get: elemtype get(list l, int pos)
</li>
<li>Insert:  bool insert(list l, elemtype x, int pos)
</li>
<li>Delete:  bool delete(list l , elemtype x)
</li>
<li>Search: int search(list l, elemtype x)
</li>
</ul>
</div>
<ol class="org-ol"><li>Operation implementation for Array representation<br/><ol class="org-ol"><li>Get<br/><div class="outline-text-6" id="text-1-1-2-1-1">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #228b22;">elemtype</span> <span style="color: #0000ff;">get</span>( <span style="color: #228b22;">list</span> <span style="color: #b8860b;">l</span> , <span style="color: #228b22;">int</span> <span style="color: #b8860b;">pos</span>) {
  <span style="color: #a020f0;">return</span> l.list[pos];
}
</pre>
</div>
</div>
</li>
<li>Insert<br/><div class="outline-text-6" id="text-1-1-2-1-2">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #228b22;">bool</span> <span style="color: #0000ff;">insert</span>(<span style="color: #228b22;">list</span> <span style="color: #b8860b;">l</span>, <span style="color: #228b22;">elemtype</span> <span style="color: #b8860b;">x</span>, <span style="color: #228b22;">int</span> <span style="color: #b8860b;">pos</span>)
{
  <span style="color: #228b22;">int</span> <span style="color: #b8860b;">len</span>= l.length;
  <span style="color: #a020f0;">if</span>(len+1 &gt;= MAXSIZE) {
    ori_l = l.list;
    l.list = (<span style="color: #228b22;">elemtype</span>*) malloc( <span style="color: #a020f0;">sizeof</span>(elemtype) * MAXSIZE *2);

    <span style="color: #a020f0;">if</span>(l.list == <span style="color: #5f9ea0;">NULL</span>)
      <span style="color: #a020f0;">return</span> <span style="color: #5f9ea0;">false</span>;

    memcpy( l.list, ori_l, <span style="color: #a020f0;">sizeof</span>(elemtype)*l.length);
    free(ori_l);
  }

  <span style="color: #a020f0;">for</span>( i = l.length-1; i &gt; pos; i++) {
    l.list[l] = l.list[l-1];
  }
  l.list[pos] = x;
  l.length++;

  <span style="color: #a020f0;">return</span> <span style="color: #5f9ea0;">true</span>;
}
</pre>
</div>
</div>
</li>
<li>Search<br/><div class="outline-text-6" id="text-1-1-2-1-3">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #228b22;">int</span> <span style="color: #0000ff;">search</span>(<span style="color: #228b22;">list</span> <span style="color: #b8860b;">l</span>, <span style="color: #228b22;">elemtype</span> <span style="color: #b8860b;">x</span>) {
  <span style="color: #228b22;">int</span> <span style="color: #b8860b;">res_pos</span>;
  <span style="color: #228b22;">int</span> <span style="color: #b8860b;">len</span> = l.length;
  <span style="color: #a020f0;">for</span>(<span style="color: #228b22;">int</span> <span style="color: #b8860b;">i</span>=0; i &lt; len; i++) {
    <span style="color: #a020f0;">if</span>(l.list[i] == x)
      <span style="color: #a020f0;">return</span> i;
  }
  <span style="color: #a020f0;">if</span>( i == len)
    <span style="color: #a020f0;">return</span> -1;
}
</pre>
</div>
</div>
</li>
<li>Delete<br/><div class="outline-text-6" id="text-1-1-2-1-4">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #228b22;">bool</span> <span style="color: #0000ff;">delete</span>(<span style="color: #228b22;">list</span> <span style="color: #b8860b;">l</span>, <span style="color: #228b22;">elemtype</span> <span style="color: #b8860b;">x</span>) {
  <span style="color: #228b22;">int</span> <span style="color: #b8860b;">pos</span> = search(l, x);
  <span style="color: #a020f0;">if</span>(pos == -1 ) {
    cout &lt;&lt; <span style="color: #bc8f8f;">"Can not find the element"</span>;
    <span style="color: #a020f0;">return</span> <span style="color: #5f9ea0;">false</span>;
  }
  <span style="color: #a020f0;">for</span>(<span style="color: #228b22;">int</span> <span style="color: #b8860b;">i</span> = pos; i &lt; l.length-1; i++) {
    l.list[i] == l.list[i+1];
  }
  l.length--;
  <span style="color: #a020f0;">return</span> <span style="color: #5f9ea0;">true</span>;
}
</pre>
</div>
</div>
</li></ol>
</li>

<li>Operation implementation for Link list representation<br/><ol class="org-ol"><li>Get<br/><div class="outline-text-6" id="text-1-1-2-2-1">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #228b22;">elemtype</span> <span style="color: #0000ff;">get</span>(<span style="color: #228b22;">list</span> <span style="color: #b8860b;">l</span>, <span style="color: #228b22;">int</span> <span style="color: #b8860b;">pos</span>) {
  <span style="color: #228b22;">int</span> <span style="color: #b8860b;">i</span> = 0;
  <span style="color: #228b22;">node</span>* <span style="color: #b8860b;">p</span> = l.list;
  <span style="color: #a020f0;">while</span>( i &lt; pos) {
    p = p-&gt;next;
    i++;
  }
  <span style="color: #a020f0;">return</span> p-&gt;val;
}
</pre>
</div>
</div>
</li>
<li>Search<br/><div class="outline-text-6" id="text-1-1-2-2-2">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #228b22;">int</span> <span style="color: #0000ff;">search</span>( <span style="color: #228b22;">list</span> <span style="color: #b8860b;">l</span>, <span style="color: #228b22;">elemtype</span> <span style="color: #b8860b;">x</span>) {
  <span style="color: #228b22;">int</span> <span style="color: #b8860b;">res</span>=0;

  p = l.list;
  <span style="color: #a020f0;">while</span>(p!=<span style="color: #5f9ea0;">NULL</span>) {
    <span style="color: #a020f0;">if</span>(p-&gt;val == x)
      <span style="color: #a020f0;">return</span> res;
    <span style="color: #a020f0;">else</span> {
      p = p-&gt;next;
      res++;
    }
  }
  <span style="color: #a020f0;">if</span>(p == <span style="color: #5f9ea0;">NULL</span>)
    <span style="color: #a020f0;">return</span> -1;
}
</pre>
</div>
</div>
</li>
<li>Insert<br/><div class="outline-text-6" id="text-1-1-2-2-3">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #228b22;">bool</span> <span style="color: #0000ff;">insert</span>( <span style="color: #228b22;">list</span> <span style="color: #b8860b;">l</span>, <span style="color: #228b22;">elemtype</span> <span style="color: #b8860b;">x</span>, <span style="color: #228b22;">int</span> <span style="color: #b8860b;">pos</span>) {
