notes/algo_ds/algo_review.org
***** Insert
#+begin_src c
bool insert( list l, elemtype x, int pos) {
  node* p = (node*) malloc( sizeof(node));
  if( p == NULL)
    return false;
   
  p->val = x;
  
  if( l.length == 0) {
    if(pos > 0 )
      cout << "Position illeage, insert at the end of the list." << endl;
    l.list = p;
    p->next = NULL;
    l.length++;
    return true;
  }
    
  int l_pos=0;
  node* q = l.list;
  node* r = q->next;
  while(r|=NULL && l_pos < pos-1) {
    q = r;
    r = r->next;
    l_pos++;
  }

  if( r == NULL && l_pos < pos) {
    cout << "Position illeage, insert at the end of the list." << endl;
    pos = l.length;
    l_pos = l.length-1;
  }

  if(l_pos == (pos-1)) {
    q->next = p;
    p->next = r;
    l.length++;
  }
  return true;
  
}
#+end_src


***** Delete

#+begin_src c
bool delete(list l, elemtype x) {
  node* p,q;
  p = l.list;
  if(p == NULL) {
     return false;
  }
  
  q = p->next;
  if(p->val == x) {
    free(p);
    l.list = q;
    l.length--;
    return true;
  }
  while( q->val != x && q !=NULL) {
    p = q;
    q = q->next;
  }
  if( q == NULL)
    return false;

  else if( q-> val == x) {
    p->next = q->next;
    free(q);
    l.length --;
    return true;
  }
}
#+end_src

*** Other data structures based on List

**** Stack
     Stack is FILO(Fisrt in, Last Out).
     Key Operation including:
     - Push: bool push( stack s, element x);
     - Pop:  element pop(stack s);

***** Push
#+begin_src c
  bool push(stack s, element x) {
    if( insert(s, x, s.length) ) {
      s.length++;
      return true;
    } else 
      return false;
  }
#+end_src

***** Pop

#+begin_src c
elemtype pop(stack s) {
  int pos = s.length-1;
  elemtype res = find(s, pos);
  if(delete(s, res))
    return elemtype;
  else {
    cout << "delete the last element error." << endl;
  }
}
#+end_src


**** Queue
     Queue is FIFO(Fist in First Out).
     Key Operation include:
     - Enqueue: bool enqueue( queue q, elemtype x);
     - Dequeue: elemtype dequeue( queue q);

***** enqueue

#+begin_src c
bool enqueue(queue q, elemtype x) {
  int len = q.length;
  if(insert(q, x, len)) {
    q.length++;
    return true;
  } else {
    return false;
  }
}
#+end_src

***** dequeue

#+begin_src c
elemtype dequeue(queue q) {
   elemtype res= find(q, 0);
   if(delete(q, res)) {
     q.length--;
     return res;
   } else {
     return false;
   }
}
#+end_src
        

**** Dictionary
     Dictionary is mostly used for accessing data items by content.
     Usually, Dictionary is required to be efficient for the following operations.
     Commonly used  Operations:
     - Search: int search( dict d, elemtype x);
     - Insert: bool insert(dict d, elemtype x);
     - Delete: bool delete(dict d, elemtype x);
     - Maximize: elemtype max(dict d);
     - Minimize: elemtype min(dict d);
     - Predecessor:find the elem whose key immediately before k in sorted order. /int predecessor(dict d, keytype k);/
     - Successor: find the elem whose key immediately after k in sorted order. /int successor(dict d, keytype k);/

       Since it has two component: the key and the value. And the key can be sorted or unsorted.
       The whole dictionary can be implmented using array and list.
       How to implement dictionary:
    - An unsorted array;
    - An array sorted by key;
    - a singly-linked unsorted list
    - a doubly-linked unsorted list
    - a singly-linked sorted list
    - a doubly-linked sorted list
    - Hash Table


      The time complexity:
| operations  | Unsorted array | Sorted Array | S-unsort list | D-unsort list | S-sort list | D-sort List |
| Search      | O(n)           | O(logn)      | O(n)          | O(n)          | O(logn)     | O(logn)     |
| Insert      | O(1)           | O(n)         | O(1)          | O(1)          | O(n)        | O(n)        |
| Delete      | O(1)           | O(n)         | O(n)          | O(1)          | O(n)        | O(1)        |
| Successor   | O(n)           | O(1)         | O(n)          | O(n)          | O(1)        | O(1)        |
| Predecessor | O(n)           | O(1)         | O(n)          | O(n)          | O(n)        | O(1)        |
| Minimum     | O(n)           | O(1)         | O(n)          | O(n)          | O(1)        | O(1)        |
| Maximum     | O(n)           | O(1)         | O(n)          | O(n)          | O(1)        | O(1)        |


