notes/algo_ds/algo_review.html
  <span style="color: #228b22;">node</span>* <span style="color: #b8860b;">p</span> = (<span style="color: #228b22;">node</span>*) malloc( <span style="color: #a020f0;">sizeof</span>(node));
  <span style="color: #a020f0;">if</span>( p == <span style="color: #5f9ea0;">NULL</span>)
    <span style="color: #a020f0;">return</span> <span style="color: #5f9ea0;">false</span>;

  p-&gt;val = x;

  <span style="color: #a020f0;">if</span>( l.length == 0) {
    <span style="color: #a020f0;">if</span>(pos &gt; 0 )
      cout &lt;&lt; <span style="color: #bc8f8f;">"Position illeage, insert at the end of the list."</span> &lt;&lt; endl;
    l.list = p;
    p-&gt;next = <span style="color: #5f9ea0;">NULL</span>;
    l.length++;
    <span style="color: #a020f0;">return</span> <span style="color: #5f9ea0;">true</span>;
  }

  <span style="color: #228b22;">int</span> <span style="color: #b8860b;">l_pos</span>=0;
  <span style="color: #228b22;">node</span>* <span style="color: #b8860b;">q</span> = l.list;
  <span style="color: #228b22;">node</span>* <span style="color: #b8860b;">r</span> = q-&gt;next;
  <span style="color: #a020f0;">while</span>(r|=<span style="color: #5f9ea0;">NULL</span> &amp;&amp; l_pos &lt; pos-1) {
    q = r;
    r = r-&gt;next;
    l_pos++;
  }

  <span style="color: #a020f0;">if</span>( r == <span style="color: #5f9ea0;">NULL</span> &amp;&amp; l_pos &lt; pos) {
    cout &lt;&lt; <span style="color: #bc8f8f;">"Position illeage, insert at the end of the list."</span> &lt;&lt; endl;
    pos = l.length;
    l_pos = l.length-1;
  }

  <span style="color: #a020f0;">if</span>(l_pos == (pos-1)) {
    q-&gt;next = p;
    p-&gt;next = r;
    l.length++;
  }
  <span style="color: #a020f0;">return</span> <span style="color: #5f9ea0;">true</span>;

}
</pre>
</div>
</div>
</li>

<li>Delete<br/><div class="outline-text-6" id="text-1-1-2-2-4">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #228b22;">bool</span> <span style="color: #0000ff;">delete</span>(<span style="color: #228b22;">list</span> <span style="color: #b8860b;">l</span>, <span style="color: #228b22;">elemtype</span> <span style="color: #b8860b;">x</span>) {
  <span style="color: #228b22;">node</span>* <span style="color: #b8860b;">p</span>,<span style="color: #b8860b;">q</span>;
  p = l.list;
  <span style="color: #a020f0;">if</span>(p == <span style="color: #5f9ea0;">NULL</span>) {
     <span style="color: #a020f0;">return</span> <span style="color: #5f9ea0;">false</span>;
  }

  q = p-&gt;next;
  <span style="color: #a020f0;">if</span>(p-&gt;val == x) {
    free(p);
    l.list = q;
    l.length--;
    <span style="color: #a020f0;">return</span> <span style="color: #5f9ea0;">true</span>;
  }
  <span style="color: #a020f0;">while</span>( q-&gt;val != x &amp;&amp; q !=<span style="color: #5f9ea0;">NULL</span>) {
    p = q;
    q = q-&gt;next;
  }
  <span style="color: #a020f0;">if</span>( q == <span style="color: #5f9ea0;">NULL</span>)
    <span style="color: #a020f0;">return</span> <span style="color: #5f9ea0;">false</span>;

  <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span>( q-&gt; val == x) {
    p-&gt;next = q-&gt;next;
    free(q);
    l.length --;
    <span style="color: #a020f0;">return</span> <span style="color: #5f9ea0;">true</span>;
  }
}
</pre>
</div>
</div>
</li></ol>
</li></ol>
</div>
<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> Other data structures based on List</h4>
<div class="outline-text-4" id="text-1-1-3">
</div><ol class="org-ol"><li>Stack<br/><div class="outline-text-5" id="text-1-1-3-1">
<p>
Stack is FILO(Fisrt in, Last Out).
Key Operation including:
</p>
<ul class="org-ul">
<li>Push: bool push( stack s, element x);
</li>
<li>Pop:  element pop(stack s);
</li>
</ul>
</div>

<ol class="org-ol"><li>Push<br/><div class="outline-text-6" id="text-1-1-3-1-1">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #228b22;">bool</span> <span style="color: #0000ff;">push</span>(<span style="color: #228b22;">stack</span> <span style="color: #b8860b;">s</span>, <span style="color: #228b22;">element</span> <span style="color: #b8860b;">x</span>) {
  <span style="color: #a020f0;">if</span>( insert(s, x, s.length) ) {
    s.length++;
    <span style="color: #a020f0;">return</span> <span style="color: #5f9ea0;">true</span>;
  } <span style="color: #a020f0;">else</span> 
    <span style="color: #a020f0;">return</span> <span style="color: #5f9ea0;">false</span>;
}
</pre>
</div>
</div>
</li>
<li>Pop<br/><div class="outline-text-6" id="text-1-1-3-1-2">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #228b22;">elemtype</span> <span style="color: #0000ff;">pop</span>(<span style="color: #228b22;">stack</span> <span style="color: #b8860b;">s</span>) {
  <span style="color: #228b22;">int</span> <span style="color: #b8860b;">pos</span> = s.length-1;
  <span style="color: #228b22;">elemtype</span> <span style="color: #b8860b;">res</span> = find(s, pos);
  <span style="color: #a020f0;">if</span>(delete(s, res))
    <span style="color: #a020f0;">return</span> elemtype;
  <span style="color: #a020f0;">else</span> {
    cout &lt;&lt; <span style="color: #bc8f8f;">"delete the last element error."</span> &lt;&lt; endl;
  }
}
</pre>
</div>
</div>
</li></ol>
</li>

<li>Queue<br/><div class="outline-text-5" id="text-1-1-3-2">
<p>
Queue is FIFO(Fist in First Out).
Key Operation include:
</p>
<ul class="org-ul">
<li>Enqueue: bool enqueue( queue q, elemtype x);
</li>
<li>Dequeue: elemtype dequeue( queue q);
</li>
</ul>
</div>

<ol class="org-ol"><li>enqueue<br/><div class="outline-text-6" id="text-1-1-3-2-1">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #228b22;">bool</span> <span style="color: #0000ff;">enqueue</span>(<span style="color: #228b22;">queue</span> <span style="color: #b8860b;">q</span>, <span style="color: #228b22;">elemtype</span> <span style="color: #b8860b;">x</span>) {
  <span style="color: #228b22;">int</span> <span style="color: #b8860b;">len</span> = q.length;
  <span style="color: #a020f0;">if</span>(insert(q, x, len)) {
    q.length++;
    <span style="color: #a020f0;">return</span> <span style="color: #5f9ea0;">true</span>;
  } <span style="color: #a020f0;">else</span> {
    <span style="color: #a020f0;">return</span> <span style="color: #5f9ea0;">false</span>;
  }
}
</pre>
</div>
</div>
</li>
<li>dequeue<br/><div class="outline-text-6" id="text-1-1-3-2-2">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #228b22;">elemtype</span> <span style="color: #0000ff;">dequeue</span>(<span style="color: #228b22;">queue</span> <span style="color: #b8860b;">q</span>) {
   <span style="color: #228b22;">elemtype</span> <span style="color: #b8860b;">res</span>= find(q, 0);
   <span style="color: #a020f0;">if</span>(delete(q, res)) {
     q.length--;
     <span style="color: #a020f0;">return</span> res;
   } <span style="color: #a020f0;">else</span> {
     <span style="color: #a020f0;">return</span> <span style="color: #5f9ea0;">false</span>;
   }
}
</pre>
</div>
</div>
</li></ol>
</li>

<li>Dictionary<br/><div class="outline-text-5" id="text-1-1-3-3">
<p>
Dictionary is mostly used for accessing data items by content.
Usually, Dictionary is required to be efficient for the following operations.
Commonly used  Operations:
</p>
<ul class="org-ul">
<li>Search: int search( dict d, elemtype x);
</li>
<li>Insert: bool insert(dict d, elemtype x);
</li>
<li>Delete: bool delete(dict d, elemtype x);
</li>
<li>Maximize: elemtype max(dict d);
</li>
<li>Minimize: elemtype min(dict d);
</li>
<li>Predecessor:find the elem whose key immediately before k in sorted order. <i>int predecessor(dict d, keytype k);</i>
</li>
<li>Successor: find the elem whose key immediately after k in sorted order. <i>int successor(dict d, keytype k);</i>

<p>
Since it has two component: the key and the value. And the key can be sorted or unsorted.
The whole dictionary can be implmented using array and list.
How to implement dictionary:
</p>
</li>
<li>An unsorted array;
</li>
<li>An array sorted by key;
</li>
<li>a singly-linked unsorted list
</li>
<li>a doubly-linked unsorted list
</li>
<li>a singly-linked sorted list
</li>
<li>a doubly-linked sorted list
</li>
<li>Hash Table
</li>
</ul>


<p>
The time complexity:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>

<col class="left"/>

<col class="left"/>

<col class="left"/>

<col class="left"/>

<col class="left"/>

<col class="left"/>
</colgroup>
<tbody>
<tr>
<td class="left">operations</td>
<td class="left">Unsorted array</td>
<td class="left">Sorted Array</td>
<td class="left">S-unsort list</td>
<td class="left">D-unsort list</td>
<td class="left">S-sort list</td>
<td class="left">D-sort List</td>
</tr>

<tr>
<td class="left">Search</td>
<td class="left">O(n)</td>
<td class="left">O(logn)</td>
<td class="left">O(n)</td>
<td class="left">O(n)</td>
<td class="left">O(logn)</td>
<td class="left">O(logn)</td>
</tr>

<tr>
<td class="left">Insert</td>
<td class="left">O(1)</td>
<td class="left">O(n)</td>
<td class="left">O(1)</td>
<td class="left">O(1)</td>
<td class="left">O(n)</td>
<td class="left">O(n)</td>
</tr>

<tr>
<td class="left">Delete</td>
<td class="left">O(1)</td>
<td class="left">O(n)</td>
<td class="left">O(n)</td>
<td class="left">O(1)</td>
<td class="left">O(n)</td>
<td class="left">O(1)</td>
</tr>

<tr>
<td class="left">Successor</td>
<td class="left">O(n)</td>
<td class="left">O(1)</td>
<td class="left">O(n)</td>
<td class="left">O(n)</td>
<td class="left">O(1)</td>
<td class="left">O(1)</td>
</tr>

<tr>
<td class="left">Predecessor</td>
<td class="left">O(n)</td>
<td class="left">O(1)</td>
<td class="left">O(n)</td>
<td class="left">O(n)</td>
<td class="left">O(n)</td>
<td class="left">O(1)</td>
</tr>

<tr>
<td class="left">Minimum</td>
<td class="left">O(n)</td>
<td class="left">O(1)</td>
<td class="left">O(n)</td>
<td class="left">O(n)</td>
<td class="left">O(1)</td>
<td class="left">O(1)</td>
</tr>

<tr>
<td class="left">Maximum</td>
<td class="left">O(n)</td>
<td class="left">O(1)</td>
<td class="left">O(n)</td>
<td class="left">O(n)</td>
<td class="left">O(1)</td>
<td class="left">O(1)</td>
</tr>
</tbody>
</table>
</div>
</li>

<li>Hash Table<br/><div class="outline-text-5" id="text-1-1-3-4">
<p>
