notes/algo_ds/algo_review.org
**** Hash Table
     Hash is a special form of dictionary. 
     It is commonly used in practical.
     When designing a hash table, several decision should be made:
     - How do I deal with collisions?
     - How big should the talbe be?
     - What hash function should I use?

     Collision Resolution is a key problem of hash.
     That is because two distinct keys will occasionally hash to the same value.
     There are several method to solve this issue:
     - Chaining
     - Open Addressing

     For the implementation of Hash Table, the following may be used:
     - Binary Search Tree
       - Since keep the tree balance is very important, 
	 random search tree, AVL tree, 2/3 tree, red-blk trees and splay tree are commonly used in practical.

     - B- Tree: It is used for large data set, which the main memory can not hold the whole data set.
       B- tree can collapse several levels of a binary search tree into a single large node, so that
       we can make the equivalent of several search steps before another disk access is needed.

     - Skip Lists: (TODO: need more reading about this data structure)

**** Priority Queues
     A container providing quick access to the smallest or largest key in the set.
     It can provide items by the highest priority of retrieval while supporting insertion, deletions and queries.
     The following data structure can be used for priority queue implementation:
     - Sorted array or list
     - Binary heaps
     - Bounded height priority queue
     - Binary Search Tree
     - Fibonacci and pairing heaps

** Tree
   Tree,take binary tree for example. For N-way tree, it is most like a graph.
   - Binary Search Tree
   - B- Tree
   - Trie Tree
   - AVL Tree
   - Red-Black Trees

#+begin_src c
// FIXME:Need to double check whether my defination is correct.
// In C++, the struct, class and enum keywords are optional, except the type defination statement.
typedef struct {
  elemtype val;
  node* parent;
  node* l_child, r_child;
}node;
typedef node tree;
#+end_src


*** Tree Operations
    - Search: node* search(tree* t, elemtype x)
    - Traversal: void  traversal(tree* t);
      - Pre-Order
      - In-Order
      - Post-Order
    - Insert: void insert(tree* t, elemtype x)
    - Delete: void delete(tree* t, elemtype x)

*** Binary Search Tree
    
**** Search

#+begin_src c
node* search(node* t, elemtype x) {
  if( t == NULL)
    return NULL;
  else if(t->val > x)
    return search(t->l_child, x);
  else if (t->val < x)
    return search(t->r_child, x);
  else if (t->val == x)
    return t;
}
#+end_src

**** Traversal

#+begin_src c
// PRE Order
// In-Order and Post-Order is simlar to Pre-order, just change the statement order.
void traversal_pre(tree* t ) {
   if(t != NULL)
     visit(t->val);   
   if(t->l_child != NULL)
     traversal_pre(t->l_child);   
   if(t->r_child != NULL)
     traversal_pre(t->r_child);
}
#+end_src

**** Insert

#+begin_src c
// For simple BST, we just insert the node as leaf
node* insert(tree* t, elemtype x) {
  if(t == NULL) {
    t = (node*)malloc(sizeof(node));
    return t;
  }
  if(t->val < x) {
    if(t->r_child != NULL)
      return insert(t->r_child, x);
    else {
      node* new_r_child = (node*)malloc(sizeof(node));
      t->r_child = new_r_child;
      new_r_child->val = x;
      new_l_child->l_child=NULL;
      new_l_child->r_child = NULL;
      new_l_child->parent = t;
      t->l_child = new_l_child;
      return new_r_child;
    }
  } else if(t->val > x) {
    if(t->l_child != NULL)
      return insert(t->l_child, x);
    else {
      node* new_l_child = (node*) malloc(sizeof(node));
      new_l_child->val = x;
      new_l_child->l_child=NULL;
      new_l_child->r_child = NULL;
      new_l_child->parent = t;
      t->l_child = new_l_child;
      return new_l_child;
      }
  }
}
#+end_src

**** Delete

#+begin_src c
// Since the memory will be deleted, we can just copy the value from the node which
// will replace the nodes place in tree, and move the values along the tree from the bottom
// to up. And then delete the leaf node only.
void delete(tree* t, node* tree_node) {
  // The node is leaf,just delete it.
  if(tree_node->l_child == NULL && tree_node->r_child == NULL) {
    if(tree_node->parent->l_child == tree_node)
        tree_node->parent->l_child = NULL;
    else if(tree_node->parenet->r_child = tree_node)
       tree_node->parent->r_child = NULL;
    free(tree_node);
  } else if(tree_node->r_child == NULL) {
     tree_node->val = tree_node->l_child->val;
     delete(t, tree_node->l_child);
  } else {
    tree_node->val = tree_node->r_child->val;
    delete(t, tree_node->r_child);
  } 
}
#+end_src

*** Trie Tree
    Trie tree is an implementation of the suffx tree.


