notes/algo_ds/algo_review.html
Hash is a special form of dictionary. 
It is commonly used in practical.
When designing a hash table, several decision should be made:
</p>
<ul class="org-ul">
<li>How do I deal with collisions?
</li>
<li>How big should the talbe be?
</li>
<li>What hash function should I use?
</li>
</ul>

<p>
Collision Resolution is a key problem of hash.
That is because two distinct keys will occasionally hash to the same value.
There are several method to solve this issue:
</p>
<ul class="org-ul">
<li>Chaining
</li>
<li>Open Addressing
</li>
</ul>

<p>
For the implementation of Hash Table, the following may be used:
</p>
<ul class="org-ul">
<li>Binary Search Tree
<ul class="org-ul">
<li>Since keep the tree balance is very important, 
random search tree, AVL tree, 2/3 tree, red-blk trees and splay tree are commonly used in practical.
</li>
</ul>
</li>

<li>B- Tree: It is used for large data set, which the main memory can not hold the whole data set.
B- tree can collapse several levels of a binary search tree into a single large node, so that
we can make the equivalent of several search steps before another disk access is needed.
</li>

<li>Skip Lists: (TODO: need more reading about this data structure)
</li>
</ul>
</div>
</li>
<li>Priority Queues<br/><div class="outline-text-5" id="text-1-1-3-5">
<p>
A container providing quick access to the smallest or largest key in the set.
It can provide items by the highest priority of retrieval while supporting insertion, deletions and queries.
The following data structure can be used for priority queue implementation:
</p>
<ul class="org-ul">
<li>Sorted array or list
</li>
<li>Binary heaps
</li>
<li>Bounded height priority queue
</li>
<li>Binary Search Tree
</li>
<li>Fibonacci and pairing heaps
</li>
</ul>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Tree</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Tree,take binary tree for example. For N-way tree, it is most like a graph.
</p>
<ul class="org-ul">
<li>Binary Search Tree
</li>
<li>B- Tree
</li>
<li>Trie Tree
</li>
<li>AVL Tree
</li>
<li>Red-Black Trees
</li>
</ul>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #b22222;">// </span><span style="color: #ff0000; font-weight: bold;">FIXME</span><span style="color: #b22222;">:Need to double check whether my defination is correct.</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">In C++, the struct, class and enum keywords are optional, except the type defination statement.</span>
<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> {
  <span style="color: #228b22;">elemtype</span> <span style="color: #b8860b;">val</span>;
  <span style="color: #228b22;">node</span>* <span style="color: #b8860b;">parent</span>;
  <span style="color: #228b22;">node</span>* <span style="color: #b8860b;">l_child</span>, <span style="color: #b8860b;">r_child</span>;
}<span style="color: #b8860b;">node</span>;
<span style="color: #a020f0;">typedef</span> <span style="color: #228b22;">node</span> <span style="color: #228b22;">tree</span>;
</pre>
</div>
</div>


<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Tree Operations</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>Search: node* search(tree* t, elemtype x)
</li>
<li>Traversal: void  traversal(tree* t);
<ul class="org-ul">
<li>Pre-Order
</li>
<li>In-Order
</li>
<li>Post-Order
</li>
</ul>
</li>
<li>Insert: void insert(tree* t, elemtype x)
</li>
<li>Delete: void delete(tree* t, elemtype x)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Binary Search Tree</h4>
<div class="outline-text-4" id="text-1-2-2">
</div><ol class="org-ol"><li>Search<br/><div class="outline-text-5" id="text-1-2-2-1">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #228b22;">node</span>* <span style="color: #0000ff;">search</span>(<span style="color: #228b22;">node</span>* <span style="color: #b8860b;">t</span>, <span style="color: #228b22;">elemtype</span> <span style="color: #b8860b;">x</span>) {
  <span style="color: #a020f0;">if</span>( t == <span style="color: #5f9ea0;">NULL</span>)
    <span style="color: #a020f0;">return</span> <span style="color: #5f9ea0;">NULL</span>;
  <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span>(t-&gt;val &gt; x)
    <span style="color: #a020f0;">return</span> search(t-&gt;l_child, x);
  <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> (t-&gt;val &lt; x)
    <span style="color: #a020f0;">return</span> search(t-&gt;r_child, x);
  <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> (t-&gt;val == x)
    <span style="color: #a020f0;">return</span> t;
}
</pre>
</div>
</div>
</li>
<li>Traversal<br/><div class="outline-text-5" id="text-1-2-2-2">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #b22222;">// </span><span style="color: #b22222;">PRE Order</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">In-Order and Post-Order is simlar to Pre-order, just change the statement order.</span>
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">traversal_pre</span>(<span style="color: #228b22;">tree</span>* <span style="color: #b8860b;">t</span> ) {
   <span style="color: #a020f0;">if</span>(t != <span style="color: #5f9ea0;">NULL</span>)
     visit(t-&gt;val);   
   <span style="color: #a020f0;">if</span>(t-&gt;l_child != <span style="color: #5f9ea0;">NULL</span>)
     traversal_pre(t-&gt;l_child);   
   <span style="color: #a020f0;">if</span>(t-&gt;r_child != <span style="color: #5f9ea0;">NULL</span>)
     traversal_pre(t-&gt;r_child);
}
</pre>
</div>
</div>
</li>
<li>Insert<br/><div class="outline-text-5" id="text-1-2-2-3">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #b22222;">// </span><span style="color: #b22222;">For simple BST, we just insert the node as leaf</span>
<span style="color: #228b22;">node</span>* <span style="color: #0000ff;">insert</span>(<span style="color: #228b22;">tree</span>* <span style="color: #b8860b;">t</span>, <span style="color: #228b22;">elemtype</span> <span style="color: #b8860b;">x</span>) {
  <span style="color: #a020f0;">if</span>(t == <span style="color: #5f9ea0;">NULL</span>) {
    t = (<span style="color: #228b22;">node</span>*)malloc(<span style="color: #a020f0;">sizeof</span>(node));
    <span style="color: #a020f0;">return</span> t;
  }
  <span style="color: #a020f0;">if</span>(t-&gt;val &lt; x) {
    <span style="color: #a020f0;">if</span>(t-&gt;r_child != <span style="color: #5f9ea0;">NULL</span>)
      <span style="color: #a020f0;">return</span> insert(t-&gt;r_child, x);
    <span style="color: #a020f0;">else</span> {
      <span style="color: #228b22;">node</span>* <span style="color: #b8860b;">new_r_child</span> = (<span style="color: #228b22;">node</span>*)malloc(<span style="color: #a020f0;">sizeof</span>(node));
      t-&gt;r_child = new_r_child;
      new_r_child-&gt;val = x;
      new_l_child-&gt;l_child=<span style="color: #5f9ea0;">NULL</span>;
      new_l_child-&gt;r_child = <span style="color: #5f9ea0;">NULL</span>;
      new_l_child-&gt;parent = t;
      t-&gt;l_child = new_l_child;
      <span style="color: #a020f0;">return</span> new_r_child;
    }
  } <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span>(t-&gt;val &gt; x) {
    <span style="color: #a020f0;">if</span>(t-&gt;l_child != <span style="color: #5f9ea0;">NULL</span>)
      <span style="color: #a020f0;">return</span> insert(t-&gt;l_child, x);
    <span style="color: #a020f0;">else</span> {
      <span style="color: #228b22;">node</span>* <span style="color: #b8860b;">new_l_child</span> = (<span style="color: #228b22;">node</span>*) malloc(<span style="color: #a020f0;">sizeof</span>(node));
      new_l_child-&gt;val = x;
      new_l_child-&gt;l_child=<span style="color: #5f9ea0;">NULL</span>;
      new_l_child-&gt;r_child = <span style="color: #5f9ea0;">NULL</span>;
      new_l_child-&gt;parent = t;
      t-&gt;l_child = new_l_child;
      <span style="color: #a020f0;">return</span> new_l_child;
      }
  }
}
</pre>
</div>
</div>
</li>
<li>Delete<br/><div class="outline-text-5" id="text-1-2-2-4">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #b22222;">// </span><span style="color: #b22222;">Since the memory will be deleted, we can just copy the value from the node which</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">will replace the nodes place in tree, and move the values along the tree from the bottom</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">to up. And then delete the leaf node only.</span>
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">delete</span>(<span style="color: #228b22;">tree</span>* <span style="color: #b8860b;">t</span>, <span style="color: #228b22;">node</span>* <span style="color: #b8860b;">tree_node</span>) {
  <span style="color: #b22222;">// </span><span style="color: #b22222;">The node is leaf,just delete it.</span>
  <span style="color: #a020f0;">if</span>(tree_node-&gt;l_child == <span style="color: #5f9ea0;">NULL</span> &amp;&amp; tree_node-&gt;r_child == <span style="color: #5f9ea0;">NULL</span>) {
    <span style="color: #a020f0;">if</span>(tree_node-&gt;parent-&gt;l_child == tree_node)
        tree_node-&gt;parent-&gt;l_child = <span style="color: #5f9ea0;">NULL</span>;
    <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span>(tree_node-&gt;parenet-&gt;r_child = tree_node)
       tree_node-&gt;parent-&gt;r_child = <span style="color: #5f9ea0;">NULL</span>;
    free(tree_node);
  } <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span>(tree_node-&gt;r_child == <span style="color: #5f9ea0;">NULL</span>) {
     tree_node-&gt;val = tree_node-&gt;l_child-&gt;val;
     delete(t, tree_node-&gt;l_child);
  } <span style="color: #a020f0;">else</span> {
    tree_node-&gt;val = tree_node-&gt;r_child-&gt;val;
    delete(t, tree_node-&gt;r_child);
  } 
}
</pre>
</div>
</div>
</li></ol>
</div>
<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> Trie Tree</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Trie tree is an implementation of the suffx tree.
</p>
</div>
</div>
</div>
