notes/algo_ds/algo_review.org
** Graph
   A graph G=(V,E)
   - V: a set of vertices
   - E: a set of edges of ordered or unordered pairs of vertices from V.
   
   Planar Graph is a type of graph which can draw all the edges in the lane without two edges cross.
   It is suitable for geometric information systems.

*** Graph properties
    - Undirected vs. Directed:
    - Weighted vs. Unweighted:
    - Simple vs. Non-simple: Non-simple graph may have self-loop edge, or two vertice may have multiple edges.
    - Sparse vs. Dense:Graph with a lot of edges is dense, otherwise it is sparse.
    - Cyclic vs. Acyclic: An acyclic graph does not have any cycle.
    - Embedded vs. Topological: 
    - Implicit vs. Explicit:
    - Labeled vs. Unlabeled:

*** Graph Operations

**** Traversing

***** Breadth-First Search

 

***** Depth-First Search

**** Spanning Tree

***** Minimun Spanning Tree

**** Shortest Path

***** Single Source Shortest Path

***** Multiple Source Shortest Path

*** Data Representations

**** Adjacency Matrix
     - A Matrix whose item [i,j] records the existence or the weight of the edge Vi to Vj.

**** Adjacency List
     - For a graph with N vertix. There is an array with N entries indicate all the vertexes.
       For each entry, a node indicates a new edge.


** Other Specialized Data Structures
   

*** String Data Structure
    - Array: character array for string representation
    - Suffix tree
    - Suffix array
*** Geometric Data Structure

*** Graph Data Structure

*** Set Data Structure
    Serval implementation of set data structure:
    - Bit vector
    - Containers or dictionaries
    - Bloom filters: bit vector based on hash

* Algorithm

** Traveling Salesman Problem
   - Input: A set S of n points
   - Output: What is the shortest cycle tour which salesman can visit all the point
   - Analysis:
     - From one point, select the nearest unvisited adjacent point until all the points are visited.  This solution can solve a subset of the condition, but not all.
     - Only select the shortest edge which connect at least one unvisited point, until all the points are connected using the edges. The solution can also solve a subset of the input.
     - This is a NP-Complete problem ( How to prove it ?)

** Independent Set Problem
   - Input: A independent set S of intervals
   - Output: What is the largest subset of mutually non-overlapping intervals which can be selected from S?
   - Analysis:
     - Select the one first start. Incorrect
     - Select the one which takes the least time. Incorrect
     - Select the one finish first. Correct.

** String Pattern Matching
   - Input: A text string t and a pattern string p.
   - Output: Does t contain the pattern p as a substring, and if so where?
   - Analysis:
     - Brute force way:  worst case –O(nm). We should check each char of test, with each char of pattern. So it is time consuming.
     - KMP's way

** Matrix Multiplication
   - Input: 2 matrix, A and B
   - Output: an multrix C=AXB
   - Analysis:
     - This problem is a classic problem in HPC. The ordinary algorithm time complex is O(n^3).


** Sorting
   - Input:  A set of sortable 
   - Output: A increase/decrease-ordered  list of element.
*** Heap Sort
    During the sorting phrase, only heap is allowed.

    Analysis:There are two ways to implement Heap Sort, using binary search tree or using priority queue.

*** Merge Sort
    Sorting by Divide-and-Conquer

    Analysis:
    - It uses a DC way to sort, and vastly used in parallel sorting
    - There is also in-place merge, Although the simplest merge sort need a extra buffer to finish the merge phrase

*** Quick Sort
    Sorting by Randomization
    
    Analysis:
    - This algorithm uses a randomization framework to sort.

*** External Sort
    When there is a lot of number to sort,  and the memory size is not large enough to hold all these numbers, we need external sort.
    Analysis:


* My Weak Algorithm

** Dynamic Programming

*** Fibonacci
Fibonacci is a recursive program original, but  the intermediate computing result can be cached, so that we do not need to compute the same value again and again.

*** Binomial Coefficients

*** Approximate String Matching
**** The Problem
     Search with archaic patterns in mind for string matching:”You should not murder” with Thou shalt not kill”. Mostly used to search for the substring closest to a given pattern to compensate for spelling errors, or evolutionary changes in genomic sequences.
     We want to find the edit distance, using three kind of changes:
     - Substitution
     - Insertion
     - Deletion

**** Brute Force Solution:
     Three option:
     - match: if(P[i] == T[j]) D[i,j] == D[i-1, j-1] else D[i,j] = D[i-1][j-1] + 1
     - insert: D[i,j] = D[i-1, j] +1
     - delete: D[i,j] = D[i, j-1] +1

This algorithm is very compilex. Since at each position, it always need to compute 3-ways. 

*** TODO TOPCODER SRM 551-1-1000 SweetFruits
    *This problem need more time to understand, it is too complex.* [fn::http://apps.topcoder.com/wiki/display/tc/SRM+551]

