notes/algo_ds/algo_review.html

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Graph</h3>
<div class="outline-text-3" id="text-1-3">
<p>
A graph G=(V,E)
</p>
<ul class="org-ul">
<li>V: a set of vertices
</li>
<li>E: a set of edges of ordered or unordered pairs of vertices from V.
</li>
</ul>

<p>
Planar Graph is a type of graph which can draw all the edges in the lane without two edges cross.
It is suitable for geometric information systems.
</p>
</div>

<div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Graph properties</h4>
<div class="outline-text-4" id="text-1-3-1">
<ul class="org-ul">
<li>Undirected vs. Directed:
</li>
<li>Weighted vs. Unweighted:
</li>
<li>Simple vs. Non-simple: Non-simple graph may have self-loop edge, or two vertice may have multiple edges.
</li>
<li>Sparse vs. Dense:Graph with a lot of edges is dense, otherwise it is sparse.
</li>
<li>Cyclic vs. Acyclic: An acyclic graph does not have any cycle.
</li>
<li>Embedded vs. Topological: 
</li>
<li>Implicit vs. Explicit:
</li>
<li>Labeled vs. Unlabeled:
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Graph Operations</h4>
<div class="outline-text-4" id="text-1-3-2">
</div><ol class="org-ol"><li>Traversing<br/><ol class="org-ol"><li>Breadth-First Search<br/></li>



<li>Depth-First Search<br/></li></ol>
</li>
<li>Spanning Tree<br/><ol class="org-ol"><li>Minimun Spanning Tree<br/></li></ol>
</li>
<li>Shortest Path<br/><ol class="org-ol"><li>Single Source Shortest Path<br/></li>

<li>Multiple Source Shortest Path<br/></li></ol>
</li></ol>
</div>
<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> Data Representations</h4>
<div class="outline-text-4" id="text-1-3-3">
</div><ol class="org-ol"><li>Adjacency Matrix<br/><div class="outline-text-5" id="text-1-3-3-1">
<ul class="org-ul">
<li>A Matrix whose item [i,j] records the existence or the weight of the edge Vi to Vj.
</li>
</ul>
</div>
</li>
<li>Adjacency List<br/><div class="outline-text-5" id="text-1-3-3-2">
<ul class="org-ul">
<li>For a graph with N vertix. There is an array with N entries indicate all the vertexes.
For each entry, a node indicates a new edge.
</li>
</ul>
</div>
</li></ol>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Other Specialized Data Structures</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> String Data Structure</h4>
<div class="outline-text-4" id="text-1-4-1">
<ul class="org-ul">
<li>Array: character array for string representation
</li>
<li>Suffix tree
</li>
<li>Suffix array
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-4-2" class="outline-4">
<h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span> Geometric Data Structure</h4>
</div>

<div id="outline-container-sec-1-4-3" class="outline-4">
<h4 id="sec-1-4-3"><span class="section-number-4">1.4.3</span> Graph Data Structure</h4>
</div>

<div id="outline-container-sec-1-4-4" class="outline-4">
<h4 id="sec-1-4-4"><span class="section-number-4">1.4.4</span> Set Data Structure</h4>
<div class="outline-text-4" id="text-1-4-4">
<p>
Serval implementation of set data structure:
</p>
<ul class="org-ul">
<li>Bit vector
</li>
<li>Containers or dictionaries
</li>
<li>Bloom filters: bit vector based on hash
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Algorithm</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Traveling Salesman Problem</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Input: A set S of n points
</li>
<li>Output: What is the shortest cycle tour which salesman can visit all the point
</li>
<li>Analysis:
<ul class="org-ul">
<li>From one point, select the nearest unvisited adjacent point until all the points are visited.  This solution can solve a subset of the condition, but not all.
</li>
<li>Only select the shortest edge which connect at least one unvisited point, until all the points are connected using the edges. The solution can also solve a subset of the input.
</li>
<li>This is a NP-Complete problem ( How to prove it ?)
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Independent Set Problem</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Input: A independent set S of intervals
</li>
<li>Output: What is the largest subset of mutually non-overlapping intervals which can be selected from S?
</li>
<li>Analysis:
<ul class="org-ul">
<li>Select the one first start. Incorrect
</li>
<li>Select the one which takes the least time. Incorrect
</li>
<li>Select the one finish first. Correct.
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> String Pattern Matching</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Input: A text string t and a pattern string p.
</li>
<li>Output: Does t contain the pattern p as a substring, and if so where?
</li>
<li>Analysis:
<ul class="org-ul">
<li>Brute force way:  worst case –O(nm). We should check each char of test, with each char of pattern. So it is time consuming.
</li>
<li>KMP's way
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Matrix Multiplication</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>Input: 2 matrix, A and B
</li>
<li>Output: an multrix C=AXB
</li>
<li>Analysis:
<ul class="org-ul">
<li>This problem is a classic problem in HPC. The ordinary algorithm time complex is O(n<sup>3</sup>).
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Sorting</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>Input:  A set of sortable 
</li>
<li>Output: A increase/decrease-ordered  list of element.
</li>
</ul>
</div>
<div id="outline-container-sec-2-5-1" class="outline-4">
<h4 id="sec-2-5-1"><span class="section-number-4">2.5.1</span> Heap Sort</h4>
<div class="outline-text-4" id="text-2-5-1">
<p>
During the sorting phrase, only heap is allowed.
</p>

<p>
Analysis:There are two ways to implement Heap Sort, using binary search tree or using priority queue.
</p>
</div>
</div>
<div id="outline-container-sec-2-5-2" class="outline-4">
<h4 id="sec-2-5-2"><span class="section-number-4">2.5.2</span> Merge Sort</h4>
<div class="outline-text-4" id="text-2-5-2">
<p>
Sorting by Divide-and-Conquer
</p>

<p>
Analysis:
</p>
<ul class="org-ul">
<li>It uses a DC way to sort, and vastly used in parallel sorting
</li>
<li>There is also in-place merge, Although the simplest merge sort need a extra buffer to finish the merge phrase
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-5-3" class="outline-4">
<h4 id="sec-2-5-3"><span class="section-number-4">2.5.3</span> Quick Sort</h4>
<div class="outline-text-4" id="text-2-5-3">
<p>
Sorting by Randomization
</p>

<p>
Analysis:
</p>
<ul class="org-ul">
<li>This algorithm uses a randomization framework to sort.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-5-4" class="outline-4">
<h4 id="sec-2-5-4"><span class="section-number-4">2.5.4</span> External Sort</h4>
<div class="outline-text-4" id="text-2-5-4">
<p>
When there is a lot of number to sort,  and the memory size is not large enough to hold all these numbers, we need external sort.
Analysis:
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> My Weak Algorithm</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Dynamic Programming</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> Fibonacci</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Fibonacci is a recursive program original, but  the intermediate computing result can be cached, so that we do not need to compute the same value again and again.
</p>
</div>
</div>
<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> Binomial Coefficients</h4>
</div>

<div id="outline-container-sec-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4">3.1.3</span> Approximate String Matching</h4>
<div class="outline-text-4" id="text-3-1-3">
</div><ol class="org-ol"><li>The Problem<br/><div class="outline-text-5" id="text-3-1-3-1">
<p>
Search with archaic patterns in mind for string matching:”You should not murder” with Thou shalt not kill”. Mostly used to search for the substring closest to a given pattern to compensate for spelling errors, or evolutionary changes in genomic sequences.
We want to find the edit distance, using three kind of changes:
</p>
<ul class="org-ul">
<li>Substitution
</li>
<li>Insertion
</li>
<li>Deletion
</li>
</ul>
</div>
</li>
<li>Brute Force Solution:<br/><div class="outline-text-5" id="text-3-1-3-2">
<p>
Three option:
</p>
<ul class="org-ul">
<li>match: if(P[i] <code>= T[j]) D[i,j] =</code> D[i-1, j-1] else D[i,j] = D[i-1][j-1] + 1
</li>
<li>insert: D[i,j] = D[i-1, j] +1
</li>
<li>delete: D[i,j] = D[i, j-1] +1
</li>
</ul>

<p>
This algorithm is very compilex. Since at each position, it always need to compute 3-ways. 
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-3-1-4" class="outline-4">
<h4 id="sec-3-1-4"><span class="section-number-4">3.1.4</span> <span class="todo TODO">TODO</span> TOPCODER SRM 551-1-1000 SweetFruits</h4>
<div class="outline-text-4" id="text-3-1-4">
<p>
<b>This problem need more time to understand, it is too complex.</b> <sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>
</p>
</div>

<ol class="org-ol"><li>My Analysis<br/><div class="outline-text-5" id="text-3-1-4-1">
<p>
key constraint:
</p>
<ul class="org-ul">
