notes/algo_ds/algo_review.org
**** My Analysis
     key constraint:
     - int[] sweetness array:
       This array is used for sweetness of every fruit. the value -1 means it is bitter.
     - N-1 strings: They can connect the fruits into any style of tree.
     - TotalSweetness: sum sweetness of all the truely sweet fruit.  
       The truely sweet fruit is the one which is sweet, and connect with at least one sweet fruit
       using string.
     
     Input:
     - The sweetness array
     - The maxsweetness constraint
     
     Output:
     - The number of possible trees which the sweetness <= maxsweetness.

     Brute Force Method:
     - We can calculate the sweetnesses of possible trees, and get the ones satisfy the TotalSweetness constraints.
     
     Try Dynamic Way:
     - Although brute force is the simple way, some trees have the same substructure. 
       So we can record the sweetness of the substructures, and by this way DP is comming.
     - Cache what? How to cache? and How to make use of it? This is the biggest chanllenge of this problem.
       - Cache the sweetness of the substructure: such as the sweetness of each tree provided by the first N fruits.
       - There are n! trees, we should record all the result of them.
       - When adding a new fruit, we needed to based on each of these trees, and connect the fruit with each of the fruit in the tree.
	 And recompute the sweetness of the tree.

**** Analysi from TopCoder
     - Suppose we have decided the set X of the truly sweet fruits yet. 
       The total sweetness of X less than or equal to MaxSweetness.
     - Then we need to find the number of trees which every fruits in X connect to another sweet fruit, 
       and sweet fruit not in X are not connected to sweet fruit.
       - *The number of trees depends on the number of elements in X. Why?*
     - The tree should be spanning trees of the following graph:
       - every sweet fruit in X is connected to all fruits, and sweet fruits not in X are connected to only bitter fruits.
     - spanning[k] denote the number of spanning trees of such a graph where |X|=k.
       Using the matrix-tree theorem[fn::http://en.wikipedia.org/wiki/Kirchhoff%27s_theorem 。This is a thereom in Graph theory.],
       we can find the number of spanning tree of any graph.
     - So, our problems turns to how to find out the number of spanning tree, and decide the set X of the truly sweet fruits.


* Programming
** 2-1 Primary Arithmetic
   This is a simple problem. Just some control code can solve it.

   However, there is a ambiguous.If the input is "999" and "1", what should the program output.


** 7-1 Little Bishops

*** My Solution
Brute Force Way. For each bishops, check whether each point is suitable. And if yes, put it there. This algorithm.
Model:
Main():





*** Suggested Solution
This problem looks much like the 8-queen problem. Once can solve it use DP or  roll-back framework, However it is hard to solve it using just brute force. DP is my weak point.

** 15-Puzzle Problem

** Tug of War
   
** Color Hash
