notes/algo_ds/algo_review.html
<li>int[] sweetness array:
This array is used for sweetness of every fruit. the value -1 means it is bitter.
</li>
<li>N-1 strings: They can connect the fruits into any style of tree.
</li>
<li>TotalSweetness: sum sweetness of all the truely sweet fruit.  
The truely sweet fruit is the one which is sweet, and connect with at least one sweet fruit
using string.
</li>
</ul>

<p>
Input:
</p>
<ul class="org-ul">
<li>The sweetness array
</li>
<li>The maxsweetness constraint
</li>
</ul>

<p>
Output:
</p>
<ul class="org-ul">
<li>The number of possible trees which the sweetness &lt;= maxsweetness.
</li>
</ul>

<p>
Brute Force Method:
</p>
<ul class="org-ul">
<li>We can calculate the sweetnesses of possible trees, and get the ones satisfy the TotalSweetness constraints.
</li>
</ul>

<p>
Try Dynamic Way:
</p>
<ul class="org-ul">
<li>Although brute force is the simple way, some trees have the same substructure. 
So we can record the sweetness of the substructures, and by this way DP is comming.
</li>
<li>Cache what? How to cache? and How to make use of it? This is the biggest chanllenge of this problem.
<ul class="org-ul">
<li>Cache the sweetness of the substructure: such as the sweetness of each tree provided by the first N fruits.
</li>
<li>There are n! trees, we should record all the result of them.
</li>
<li>When adding a new fruit, we needed to based on each of these trees, and connect the fruit with each of the fruit in the tree.
And recompute the sweetness of the tree.
</li>
</ul>
</li>
</ul>
</div>
</li>
<li>Analysi from TopCoder<br/><div class="outline-text-5" id="text-3-1-4-2">
<ul class="org-ul">
<li>Suppose we have decided the set X of the truly sweet fruits yet. 
The total sweetness of X less than or equal to MaxSweetness.
</li>
<li>Then we need to find the number of trees which every fruits in X connect to another sweet fruit, 
and sweet fruit not in X are not connected to sweet fruit.
<ul class="org-ul">
<li><b>The number of trees depends on the number of elements in X. Why?</b>
</li>
</ul>
</li>
<li>The tree should be spanning trees of the following graph:
<ul class="org-ul">
<li>every sweet fruit in X is connected to all fruits, and sweet fruits not in X are connected to only bitter fruits.
</li>
</ul>
</li>
<li>spanning[k] denote the number of spanning trees of such a graph where |X|=k.
Using the matrix-tree theorem<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>,
we can find the number of spanning tree of any graph.
</li>
<li>So, our problems turns to how to find out the number of spanning tree, and decide the set X of the truly sweet fruits.
</li>
</ul>
</div>
</li></ol>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Programming</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 2-1 Primary Arithmetic</h3>
<div class="outline-text-3" id="text-4-1">
<p>
This is a simple problem. Just some control code can solve it.
</p>

<p>
However, there is a ambiguous.If the input is "999" and "1", what should the program output.
</p>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 7-1 Little Bishops</h3>
<div class="outline-text-3" id="text-4-2">
</div><div id="outline-container-sec-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> My Solution</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
Brute Force Way. For each bishops, check whether each point is suitable. And if yes, put it there. This algorithm.
Model:
Main():
</p>
</div>
</div>




<div id="outline-container-sec-4-2-2" class="outline-4">
<h4 id="sec-4-2-2"><span class="section-number-4">4.2.2</span> Suggested Solution</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
This problem looks much like the 8-queen problem. Once can solve it use DP or  roll-back framework, However it is hard to solve it using just brute force. DP is my weak point.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 15-Puzzle Problem</h3>
</div>

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Tug of War</h3>
</div>

<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> Color Hash</h3>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p><a href="http://apps.topcoder.com/wiki/display/tc/SRM+551">http://apps.topcoder.com/wiki/display/tc/SRM+551</a></p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p><a href="http://en.wikipedia.org/wiki/Kirchhoff%27s_theorem">http://en.wikipedia.org/wiki/Kirchhoff%27s_theorem</a> 。This is a thereom in Graph theory.</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: erlv</p>
<p class="date">Created: 2013-07-03 Wed 22:18</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 23.4.1 (<a href="http://orgmode.org">Org</a> mode 8.0.3)</p>
<p class="xhtml-validation"><a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a></p>
</div>
</body>
</html>
